
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаВыбораДаты = ПолучитьФорму("ОбщаяФорма.ФормаВыбораДаты");
	ФормаВыбораДаты.Заголовок = "Введите дату актуальности";
	ФормаВыбораДаты.Дата = ТекущаяДата();
		
	Если ФормаВыбораДаты.ОткрытьМодально() = Истина Тогда
		
		ДатаСреза = ФормаВыбораДаты.Дата;
		
		Если Не ОбщегоНазначенияСервер.КурсыВалютАктуальны(ДатаСреза) Тогда
			
			Ответ = ВопросАсинх("Курсы валют неактуальны! Вы хотите обновить курсы валют?", РежимДиалогаВопрос.ДаНетОтмена);
			
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда 
				
				ФормаВводаКурсов = ПолучитьФорму("ОбщаяФорма.ФормаВводаКурсовВалют");
				ФормаВводаКурсов.ДатаКурсов = ДатаСреза;
				
				Если Не ФормаВводаКурсов.Открыта() Тогда
					ФормаВводаКурсов.ОткрытьМодально();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СоздатьТочкуАктуальности(ДатаСреза);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТочкуАктуальности(Дата)
	
	// получаем остатки на конец текущего дня
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДенежныеСредстваОстатки.Счет КАК Счет,
	               |	ДенежныеСредстваОстатки.Валюта КАК Валюта,
	               |	ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма,
	               |	ДенежныеСредстваОстатки.СуммаОстаток * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаУчетн
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСчетам.Остатки(&ДатаСреза, Не Счет.Забалансовый) КАК ДенежныеСредстваОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаСреза, ) КАК КурсыВалютСрезПоследних
	               |		ПО ДенежныеСредстваОстатки.Валюта = КурсыВалютСрезПоследних.Валюта";
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));			   
	ТаблицаДляЗаписи = Запрос.Выполнить().Выгрузить();
	
	// записываем таблицу остатков в регистр
	НаборЗаписей = РегистрыСведений.ТочкиАктуальности.СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Загрузить(ТаблицаДляЗаписи);
	сткПериод = Новый Структура("Период", Дата);
	НаборЗаписей.Заполнить(сткПериод);	
	НаборЗаписей.Записать();
	
	// сообщим пользователю о новой точке актуальности
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создана точка актуальности " + Формат(Дата, "ДЛФ=DD");
	Сообщение.Сообщить();
	
КонецПроцедуры	