
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	Отказ = Истина;
	ПараметрыЗакрытия = Новый Структура("РасходПроведен", Ложь);
	ООЗакрытиеФормыРасхода = Новый ОписаниеОповещения("ООЗакрытиеФормыРасхода", ЭтотОбъект, ПараметрыЗакрытия);
	ПараметрыОткрытия = Новый Структура("Основание", Объект);
	ОткрытьФорму("Документ.РасходДенежныхСредств.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, 
					, , , ООЗакрытиеФормыРасхода, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Возврат;				
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ООЗакрытиеФормыРасхода(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.РасходПроведен Тогда
		
		ВыполнитьЗадачуНаСервере();
		Оповестить("ВыполнениеЗадачи");
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ВыполнитьЗадачуНаСервере()
		
	Если Не Объект.Выполнена Тогда
		
		ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
		ЗадачаОбъект.ВыполнитьЗадачу();
		ЗначениеВРеквизитФормы(ЗадачаОбъект, "Объект");
		
	КонецЕсли;		 
	
КонецПроцедуры	

#КонецОбласти
