
&НаСервере
Процедура СформироватьНаСервере()
	
	ТабличныйДокумент = РеквизитФормыВЗначение("Отчет").Сформировать();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.ДатаПрогноза) Тогда
		Сообщить("Не заполнена дата прогноза!");
		Возврат;
	КонецЕсли;	
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДатаОтчета = ТекущаяДата();
	Отчет.ДатаПрогноза = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры
