Функция ПолучитьОсновнуюВалютуУчета() Экспорт 
	
	Возврат Константы.ОсновнаяВалютаУчёта.Получить();
	
КонецФункции

Функция ПолучитьСуммуЛиквидов(ДатаОтчета) Экспорт 
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОстаткиПоСчетам.СуммаОстаток * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСчетам.Остатки(
	               |			&ДатаОтчета,
	               |			Счет В
	               |				(ВЫБРАТЬ
	               |					Справочник.Счета.Ссылка
	               |				ИЗ
	               |					Справочник.Счета
	               |				ГДЕ
	               |					Справочник.Счета.Забалансовый = ЛОЖЬ
	               |					И Справочник.Счета.Ликвидный = ИСТИНА)) КАК ОстаткиПоСчетам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОтчета, ) КАК КурсыВалютСрезПоследних
	               |		ПО ОстаткиПоСчетам.Валюта = КурсыВалютСрезПоследних.Валюта";
	Запрос.УстановитьПараметр("ДатаОтчета", Новый Граница(ДатаОтчета, ВидГраницы.Включая));				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Сумма;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции	
	