
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = СформироватьОтчетСКД();
		
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСКД() Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	УстановитьПараметрДанных(ПараметрыДанных, "ДатаОтчета", ?(ЗначениеЗаполнено(ДатаОтчета), КонецДня(ДатаОтчета), ТекущаяДата()));
	УстановитьПараметрДанных(ПараметрыДанных, "СчетЯвляетсяЗабалансовым", ВидыСчетов = Перечисления.ВидыСчетов.Забалансовые);
	УстановитьПараметрДанных(ПараметрыДанных, "ПоказыватьВсеСчета", ВидыСчетов = Перечисления.ВидыСчетов.Все);
	
	ОтчетБД = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновки = ОтчетБД.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Отчет.КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(табДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТабДок;
	
КонецФункции	

//&НаСервереБезКонтекста
//Процедура УстановитьПараметрДанных(КоллецияПараметров, ИмяПараметра, Значение) 
//	
//	Параметр = КоллецияПараметров.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
//	Если Параметр <> Неопределено Тогда
//		
//		//Если ИмяПараметра = "ДатаОтчета" Тогда 
//		//	ПараметрПериод.Значение = Значение;
//		//	
//		//ИначеЕсли ИмяПараметра = "СчетЯвляетсяЗабалансовым"	Тогда 
//		//ИначеЕсли ИмяПараметра = "ПоказыватьВсеСчета" Тогда 
//		//КонецЕсли;	
//		
//		Параметр.Значение = Значение;
//		Параметр.Использование = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтчета = ТекущаяДата();
	ВидыСчетов = Перечисления.ВидыСчетов.Балансовые;
	
КонецПроцедуры

