&НаКлиенте
Перем Отбор;
&НаКлиенте
Перем ИспользованиеОтбора;

// управляет видимостью задач путём пеерключения режимов: отображение всех задач или отображени только активных задач
&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	ИспользованиеОтбора = Не ИспользованиеОтбора;
	УстановитьОтборПоАктивности(ИспользованиеОтбора);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//раскрасим выполненные задачи
	УстановитьОтборПоАктивности(ИспользованиеОтбора);
	
КонецПроцедуры

&НаКлиенте
// устанавливает режим использования отбора задач по активности
Процедура УстановитьОтборПоАктивности(ИспользованиеОтбора)
	
	Если Отбор = Неопределено Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена");
		Отбор.ПравоеЗначение = Ложь;
	КонецЕсли;
	
	Отбор.Использование = ИспользованиеОтбора;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПоказатьЗадачи.Заголовок = ?(ИспользованиеОтбора, "Показать все", "Показать активные");
	
КонецПроцедуры	

// раскрашивает строки выполненных задач в радикальный бледно-зеленый цвет
Процедура РаскраситьЗавершенныеЗадачи()
	
	УО = Список.УсловноеОформление.Элементы.Добавить();
	
	Отбор = УО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена");
	Отбор.ПравоеЗначение = Истина;
	
	ЦветФона = УО.Оформление.Элементы.Найти("ЦветФона");
	ЦветФона.Значение = WebЦвета.БледноЗеленый;
	ЦветФона.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаскраситьЗавершенныеЗадачи();	
	
КонецПроцедуры


ИспользованиеОтбора = Истина;

