
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// проведение по регистру "Планируемые покупки"
	Движения.ОстаткиПланируемыхПокупок.Записывать = Истина;
	ДвижениеПП = Движения.ОстаткиПланируемыхПокупок.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(ДвижениеПП, Ссылка);
	ДвижениеПП.Период = Дата;
	ДвижениеПП.Активность = Истина;
	
	// проведение по регистру "Состояния планируемых покупок"
	Движения.СостоянияПланируемыхПокупок.Записывать = Истина;
	ДвижениеСостояние = Движения.СостоянияПланируемыхПокупок.Добавить();
	ЗаполнитьЗначенияСвойств(ДвижениеСостояние, Ссылка, "Сумма,ПланируемаяПокупка");
	ДвижениеСостояние.Период = Дата;
	ДвижениеСостояние.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияПланируемойПокупки.Регистрация");
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоДня(Дата);
КонецПроцедуры
