#Область ОписаниеПеременных

&НаКлиенте
Перем ДниНедели;

#КонецОбласти


#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДниНедели = ОбщегоНазначенияКлиент.ПолучитьСоответствиеДнейНедели();
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОписаниеОповещенияОЗакрытии <> Неопределено
        И ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Свойство("РасходПроведен") Тогда

        ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.РасходПроведен = Объект.Проведен;
        
    КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры

#КонецОбласти


