#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрВыбора = Новый ПараметрВыбора("НеПоказыватьОсновнуюВалютуУчета", Истина);
	ПредварительныйМассив = Новый Массив();
	ПредварительныйМассив.Добавить(ПараметрВыбора);
	
	Элементы.Валюта.ПараметрыВыбора = Новый ФиксированныйМассив(ПредварительныйМассив);	
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ПриИзмененииПараметраОтбора(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)

	ПриИзмененииПараметраОтбора(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ПриИзмененииПараметраОтбора(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПараметрОтбора(Имя, Значение)
	
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(Имя, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметраОтбора(Элемент)
	
	Если Элемент.Имя = "НачалоПериода" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.НачалоПериода);
	ИначеЕсли Элемент.Имя = "КонецПериода" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.КонецПериода);
	ИначеЕсли Элемент.Имя = "Валюта" Тогда
		УстановитьПараметрОтбора(Элемент.Имя, Отчет.Валюта);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВалюты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Отчет.Валюта = Результат;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
