&НаКлиенте
Перем ДниНедели;

&НаКлиенте
Процедура ВидОперацииОчистка(Элемент, СтандартнаяОбработка)
	
	// не будем давать очищать этот реквизит, так как без него неясен смысл и интерфейс документа
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура УправлениеВидимостьюРеквизитов()
	
	Если Объект.ВидОперации = Перечисления.ВидыДолговыхОпераций.СписаниеДолга Тогда
		ВидимостьСписанияДолга = Истина;
		ВидимостьУвеличенияДолга = Ложь;
		ВидимостьКурсаКратности = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыДолговыхОпераций.УвеличениеДолга Тогда
		ВидимостьСписанияДолга = Ложь;
		ВидимостьУвеличенияДолга = Истина;
		ВидимостьКурсаКратности = Ложь;
	Иначе
		ВидимостьСписанияДолга = Истина;
		ВидимостьУвеличенияДолга = Истина;
		ВидимостьКурсаКратности = Истина;
	КонецЕсли;	
	
	Элементы.ГруппаСписаниеДолга.Видимость = ВидимостьСписанияДолга;
	Элементы.ГруппаУвеличениеДолга.Видимость = ВидимостьУвеличенияДолга;
	Элементы.ГруппаКурс.Видимость = ВидимостьКурсаКратности;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостьюРеквизитов();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСписанияПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") И Не ЗначениеЗаполнено(Объект.СуммаУвеличения) Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаУвеличенияПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") И Не ЗначениеЗаполнено(Объект.СуммаСписания) Тогда
		Если ЗначениеЗаполнено(Объект.Курс) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаСписания = Объект.СуммаУвеличения * Объект.Курс / Объект.Кратность;
			Иначе	
				Объект.СуммаСписания = Объект.СуммаУвеличения * Объект.Кратность / Объект.Курс;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьКурсПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КратностьПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДолговыхОпераций.ПереносДолга") Тогда
		Если ЗначениеЗаполнено(Объект.Кратность) И ЗначениеЗаполнено(Объект.Курс) Тогда
			Если Объект.ИнвертироватьКурс Тогда
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Кратность / Объект.Курс;
			Иначе	
				Объект.СуммаУвеличения = Объект.СуммаСписания * Объект.Курс / Объект.Кратность;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДниНедели = ОбщегоНазначенияКлиент.ПолучитьСоответствиеДнейНедели();
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры


