
Процедура ОбработкаЗаполнения(Основание)
	
	Валюта = Константы.ОсновнаяВалютаУчёта.Получить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	УчётнаяСумма = Сумма*Курс/Кратность;	
	// проведение по регистру "Остатки по счетам"
	
	ДвижениеОстатки = Движения.ОстаткиПоСчетам.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(ДвижениеОстатки, Ссылка);
	ДвижениеОстатки.СуммаУчетн = УчётнаяСумма;
	ДвижениеОстатки.Период = Дата;
	
	УчётДоходы = Не (Счет.Забалансовый Или НеУчитыватьВСтруктуреДоходов);
	УчётДолговыеОбязательства = (Не Счет.Забалансовый) И ЗначениеЗаполнено(Должник);
	
	Если УчётДоходы Тогда  // для забалансовых счетов нет смысла считать расходы, нужно только контролировать остатки
		
		// проведение по регистру "Доходы"
		ДвижениеДоходы = Движения.Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеДоходы, Ссылка);
		ДвижениеДоходы.СуммаУчетн = УчётнаяСумма;
		ДвижениеДоходы.Период = Дата;
		
	КонецЕсли;
	
	// формируем движения по регистру "Долговые обязательства"
	Если УчётДолговыеОбязательства Тогда
		
		ДвижениеДолги = Движения.ДолговыеОбязательства.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(ДвижениеДолги, Ссылка);
		ДвижениеДолги.Должник = Ссылка.Должник;
		ДвижениеДолги.Период = Дата;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоДня(Дата);
КонецПроцедуры
