#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ПроверитьКомиссию - проверяет, является ли этот документ выплатой комиссии,
// связанной с документом "Преемещением денежных средств"
// если это комиссия, то проведение и распроведение напрямую запрещаются
// Параметры.Ссылка - ДокументСсылка.РасходДенежныхСредств, ссылка на документ расхода
Процедура ПроверитьКомиссию(Ссылка, Отказ) Экспорт 
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПеремещениеДенежныхСредств.Ссылка Как Перемещение
		|ИЗ
		|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|ГДЕ
		|	ПеремещениеДенежныхСредств.ДокументКомиссии = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);			   
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данный документ является оплатой комиссии! Работа с ним возможна только через документ перемещения!" + Символы.ПС + "Дважды кликните на это сообщение и измените документ перемещение.";
			Сообщение.КлючДанных = Выборка.Перемещение;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли