
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// отфильтруем счета только при вводе по строке
	Если Не ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Счета.Ссылка
		               |ИЗ
		               |	Справочник.Счета КАК Счета
		               |ГДЕ
		               |	НЕ Счета.ПометкаУдаления
		               |	И Счета.Наименование ПОДОБНО &СтрокаПоиска";
		Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(Параметры.СтрокаПоиска) + "%");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры
