#Область ПрограммныйИнтерфейс

Процедура ОбновитьТочкуАктуальности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ТочкиАктуальностиСрезПоследних.Период) КАК ДатаАктуальности
	               |ПОМЕСТИТЬ ДатыАктуальности
	               |ИЗ
	               |	РегистрСведений.ТочкиАктуальности.СрезПоследних КАК ТочкиАктуальностиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТочкиАктуальностиСрезПоследних.Период КАК Дата,
	               |	СУММА(ТочкиАктуальностиСрезПоследних.СуммаУчетн) КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ТочкиАктуальности.СрезПоследних КАК ТочкиАктуальностиСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыАктуальности КАК ДатыАктуальности
	               |		ПО ТочкиАктуальностиСрезПоследних.Период = ДатыАктуальности.ДатаАктуальности
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТочкиАктуальностиСрезПоследних.Период";
	ТабЗапрос = Запрос.Выполнить().Выгрузить();			   
	ПараметрыСеанса.ТочкаАктуальности = Новый ФиксированнаяСтруктура("Дата,Сумма", ТабЗапрос[0].Дата, ТабЗапрос[0].Сумма);
	
КонецПроцедуры	

#КонецОбласти
	