
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	ПредыдущаяДата = Дата;
	//ОтрисоватьРеквизитыФормы();
	ПрочитатьПоказателиСчетчиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда 
		
		Ответ = Вопрос("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаписатьНаСервере();
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// КОМАНДЫ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ
	
&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Модифицированность Тогда 
		Ответ = Вопрос("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ВременнаяДата = Дата;
			Дата = ПредыдущаяДата;
			ЗаписатьНаСервере();
			Дата = ВременнаяДата;
			ПрочитатьПоказателиСчетчиков();
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			
			ПрочитатьПоказателиСчетчиков();
			Модифицированность = Ложь;
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Дата = ПредыдущаяДата;
		КонецЕсли;
		
	Иначе
		
		ПрочитатьПоказателиСчетчиков();
		
	КонецЕсли;	
	
	ПредыдущаяДата = Дата;
	РазвернутьВетвиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателяПриИзменении(Элемент)
	
	Модифицированность = Истина;	
	
КонецПроцедуры


// СЕРВЕРНЫЕ ПРОЦЕДУРЫ

// ЗаписатьНаСервере - записывает в базу значения показателей счетчиков
Процедура ЗаписатьНаСервере()
	
	//МассивСтрокКУдалению = Новый Массив;
	//ТаблицаРегистра = РеквизитФормыВЗначение("ТаблицаСоответствияРеквизитов");
	//ТаблицаРегистра.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	//ТаблицаРегистра.ЗаполнитьЗначения(Дата, "Период");
	//
	//Для Каждого Строка Из ТаблицаРегистра Цикл
	//	Строка.ЗначениеПоказателя = ЭтаФорма[Строка.ИмяРеквизита];
	//	
	//	Если Строка.ЗначениеПоказателя = 0 Тогда
	//		МассивСтрокКУдалению.Добавить(Строка);
	//	КонецЕсли;	
	//КонецЦикла;	
	//
	//Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
	//	ТаблицаРегистра.Удалить(СтрокаКУдалению);
	//КонецЦикла;
	//	
	//ТаблицаРегистра.Колонки.Удалить("ИмяРеквизита");
	
	НаборЗаписей = РегистрыСведений.ПоказанияСчётчиков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Дата);
	
	Для Каждого ВетвьГруппы Из ДеревоПоказателей.ПолучитьЭлементы() Цикл
		
		Для Каждого ВетвьСчетчика Из ВетвьГруппы.ПолучитьЭлементы() Цикл
			
			Запись 			= НаборЗаписей.Добавить();
			Запись.Счётчик 	= ВетвьСчетчика.Счетчик;
			Запись.Период 	= Дата;
			Запись.ЗначениеПоказателя = ВетвьСчетчика.ТекущееПоказание;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	//НаборЗаписей.Загрузить(ТаблицаРегистра);
	НаборЗаписей.Записать();
	
	Модифицированность = Ложь;
	
КонецПроцедуры	

// ОтрисоватьРеквизитыФормы - динамически отрисовывает форму ввода показателей счетчиков
Процедура ОтрисоватьРеквизитыФормы()
	
	ОТПоказаниеСчетчика = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный));
	ОТДата 				= Новый ОписаниеТипов("Дата", ,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	МассивРеквизитов 	= Новый Массив;
	
	// получим список счетчиков и папок
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Счетчики.Ссылка КАК Ссылка,
	               |	Счетчики.Наименование КАК Наименование,
	               |	Счетчики.ПометкаУдаления,
	               |	Счетчики.СерийныйНомер
	               |ИЗ
	               |	Справочник.Счетчики КАК Счетчики
	               |ГДЕ
	               |	НЕ Счетчики.ЭтоГруппа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование
	               |ИТОГИ ПО
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	ВыборкаГрупп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СчетчикГрупп = 0;
	СчетчикЭлементов = 1;
	
	Пока ВыборкаГрупп.Следующий() Цикл
		
		Если Не ВыборкаГрупп.ПометкаУдаления Тогда
			
			СчетчикГрупп = СчетчикГрупп + 1;
			
			Группа = Элементы.Добавить("Группа" + Строка(СчетчикГрупп), Тип("ГруппаФормы"));
			Группа.Заголовок = ВыборкаГрупп.Наименование;
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.Отображение = ОтображениеОбычнойГруппы.РамкаГруппы;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			ВыборкаЭлементов = ВыборкаГрупп.Выбрать();
			
			Пока ВыборкаЭлементов.Следующий() Цикл
				
				Если Не ВыборкаЭлементов.ПометкаУдаления Тогда
					
					ИмяРеквизита = "ПоказаниеСчетчика" + Строка(СчетчикЭлементов);
					
					СтрокаСоответствия = ТаблицаСоответствияРеквизитов.Добавить();
					СтрокаСоответствия.ИмяРеквизита = ИмяРеквизита;
					СтрокаСоответствия.Счётчик = ВыборкаЭлементов.Ссылка;
					СтрокаСоответствия.НомерГруппы = СчетчикГрупп;
					СтрокаСоответствия.Наименование = ВыборкаЭлементов.Наименование;
					СтрокаСоответствия.СерийныйНомер = ВыборкаЭлементов.СерийныйНомер;
					
					НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, ОТПоказаниеСчетчика, , ВыборкаЭлементов.Наименование);
					МассивРеквизитов.Добавить(НовыйРеквизит);
					
					НовыйРеквизит = Новый РеквизитФормы("Предыдущее" + ИмяРеквизита, ОТПоказаниеСчетчика, , "");
					МассивРеквизитов.Добавить(НовыйРеквизит);
					
					НовыйРеквизит = Новый РеквизитФормы("ДатаПредыдущего" + ИмяРеквизита, ОТДата, , "");
					МассивРеквизитов.Добавить(НовыйРеквизит);
					
					СчетчикЭлементов = СчетчикЭлементов + 1;
					
				КонецЕсли;
				
			КонецЦикла;
						
		КонецЕсли;
		
	КонецЦикла;	
	
	ИзменитьРеквизиты(МассивРеквизитов);

	Для Каждого СтрокаРеквизита Из ТаблицаСоответствияРеквизитов Цикл
		
		Группа = Элементы["Группа" + Строка(СтрокаРеквизита.НомерГруппы)];
		
		ГруппаСчетчика = Элементы.Добавить("ГруппаСчетчика" + СтрокаРеквизита.ИмяРеквизита, Тип("ГруппаФормы"), Группа);
		ГруппаСчетчика.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСчетчика.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСчетчика.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Элемент = Элементы.Добавить(СтрокаРеквизита.ИмяРеквизита, Тип("ПолеФормы"), ГруппаСчетчика);
		Элемент.ПутьКДанным = СтрокаРеквизита.ИмяРеквизита;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.Заголовок = СтрокаРеквизита.Наименование + ?(ЗначениеЗаполнено(СтрокаРеквизита.СерийныйНомер), " (" + СтрокаРеквизита.СерийныйНомер + ")", "");
		Элемент.УстановитьДействие("ПриИзменении", "ЗначениеПоказателяПриИзменении");
		
		Элемент = Элементы.Добавить("Предыдущее" + СтрокаРеквизита.ИмяРеквизита, Тип("ПолеФормы"), ГруппаСчетчика);
		Элемент.ПутьКДанным = "Предыдущее" + СтрокаРеквизита.ИмяРеквизита;
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.Заголовок = "Предущее показание ";
		
		Элемент = Элементы.Добавить("ДатаПредыдущего" + СтрокаРеквизита.ИмяРеквизита, Тип("ПолеФормы"), ГруппаСчетчика);
		Элемент.ПутьКДанным = "ДатаПредыдущего" + СтрокаРеквизита.ИмяРеквизита;
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
	КонецЦикла;	
	
	// переместим кнопки записи и закрытия в низ формы
	Элементы.Переместить(Элементы.Записать, ЭтаФорма);
	
КонецПроцедуры

Процедура ПрочитатьПоказателиСчетчиков()
	
	ДеревоПоказателей.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаРеквизитов.ИмяРеквизита КАК ИмяРеквизита,
	               |	ТаблицаРеквизитов.Счётчик КАК Счётчик
	               |ПОМЕСТИТЬ ТаблицаСчетчиков
	               |ИЗ
	               |	&ТаблицаРеквизитов КАК ТаблицаРеквизитов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоказанияСчётчиков.Счётчик КАК Счётчик,
	               |	ПоказанияСчётчиков.ЗначениеПоказателя КАК ЗначениеПоказателя
	               |ПОМЕСТИТЬ ПоказанияСчетчиков
	               |ИЗ
	               |	РегистрСведений.ПоказанияСчётчиков КАК ПоказанияСчётчиков
	               |ГДЕ
	               |	ПоказанияСчётчиков.Период = &Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоказанияСчётчиковСрезПоследних.Период КАК ДатаПредыдущегоПоказания,
	               |	ПоказанияСчётчиковСрезПоследних.ЗначениеПоказателя КАК ПредыдущееЗначениеПоказателя,
	               |	ТаблицаСчетчиков.Счётчик КАК Счётчик
	               |ПОМЕСТИТЬ ПредыдущиеПоказания
	               |ИЗ
	               |	ТаблицаСчетчиков КАК ТаблицаСчетчиков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияСчётчиков.СрезПоследних(&Период, ) КАК ПоказанияСчётчиковСрезПоследних
	               |		ПО ТаблицаСчетчиков.Счётчик = ПоказанияСчётчиковСрезПоследних.Счётчик
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСчетчиков.ИмяРеквизита КАК ИмяРеквизита,
	               |	ЕСТЬNULL(ПоказанияСчетчиков.ЗначениеПоказателя, 0) КАК ЗначениеПоказателя,
	               |	ЕСТЬNULL(ПредыдущиеПоказания.ДатаПредыдущегоПоказания, 0) КАК ДатаПредыдущегоПоказания,
	               |	ЕСТЬNULL(ПредыдущиеПоказания.ПредыдущееЗначениеПоказателя, 0) КАК ПредыдущееЗначениеПоказателя
	               |ИЗ
	               |	ТаблицаСчетчиков КАК ТаблицаСчетчиков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоказанияСчетчиков КАК ПоказанияСчетчиков
	               |		ПО ТаблицаСчетчиков.Счётчик = ПоказанияСчетчиков.Счётчик
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущиеПоказания КАК ПредыдущиеПоказания
	               |		ПО ТаблицаСчетчиков.Счётчик = ПредыдущиеПоказания.Счётчик";
	Запрос.УстановитьПараметр("ТаблицаРеквизитов", РеквизитФормыВЗначение("ТаблицаСоответствияРеквизитов"));
	Запрос.УстановитьПараметр("Период", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		 ЭтаФорма[Выборка.ИмяРеквизита] = Выборка.ЗначениеПоказателя;
		 ЭтаФорма["Предыдущее" + Выборка.ИмяРеквизита] = Выборка.ПредыдущееЗначениеПоказателя;
		 ЭтаФорма["ДатаПредыдущего" + Выборка.ИмяРеквизита] = Выборка.ДатаПредыдущегоПоказания;
		
	КонецЦикла;	
	 
	Запрос.Текст = "ВЫБРАТЬ
	               |	Счетчики.Наименование КАК Наименование,
	               |	Счетчики.СерийныйНомер КАК СерийныйНомер,
	               |	Счетчики.Ссылка КАК Счетчик,
	               |	Счетчики.ЭтоГруппа КАК ЭтоГруппа,
	               |	ЕСТЬNULL(ПоказанияСчётчиков.ЗначениеПоказателя, 0) КАК ТекущееПоказание,
	               |	ЕСТЬNULL(ПоказанияСчётчиковСрезПоследних.ЗначениеПоказателя, 0) КАК ПредыдущееПоказание,
	               |	ЕСТЬNULL(ПоказанияСчётчиковСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПредыдущегоПоказания
	               |ИЗ
	               |	Справочник.Счетчики КАК Счетчики
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияСчётчиков.СрезПоследних(&ДатаСреза, ) КАК ПоказанияСчётчиковСрезПоследних
	               |		ПО Счетчики.Ссылка = ПоказанияСчётчиковСрезПоследних.Счётчик
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияСчётчиков КАК ПоказанияСчётчиков
	               |		ПО Счетчики.Ссылка = ПоказанияСчётчиков.Счётчик
	               |			И (ПоказанияСчётчиков.Период = &Период)
	               |ГДЕ
	               |	НЕ Счетчики.ПометкаУдаления
	               |	И НЕ Счетчики.ЭтоГруппа
	               |ИТОГИ ПО
	               |	Счетчик ТОЛЬКО ИЕРАРХИЯ"; 
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата - 86400);
	
	ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппы.Следующий() Цикл
		
		ВетвьГруппы = ДеревоПоказателей.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(ВетвьГруппы, Выборка);
		ВетвьГруппы.Заголовок = ВыборкаГруппы.Наименование;
		ВетвьГруппы.ЭтоГруппа = Истина;
		
		ВыборкаСчетчик = ВыборкаГруппы.Выбрать();
		
		Пока ВыборкаСчетчик.Следующий() Цикл
			
			ВетвьСчетчика = ВетвьГруппы.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(ВетвьСчетчика, ВыборкаСчетчик);
			ВетвьСчетчика.Заголовок = ВыборкаСчетчик.Наименование + ?(ЗначениеЗаполнено(ВыборкаСчетчик.СерийныйНомер), " (" + ВыборкаСчетчик.СерийныйНомер + ")", "");
			ВетвьСчетчика.Прирост = ВетвьСчетчика.ТекущееПоказание - ВетвьСчетчика.ПредыдущееПоказание;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьВетвиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВетвиДерева()
	
	Для Каждого Ветвь Из ДеревоПоказателей.ПолучитьЭлементы() Цикл
		Элементы.ДеревоПоказателей.Развернуть(Ветвь.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоПоказателейТекущееПоказаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПоказателей.ТекущиеДанные;
	ТекущиеДанные.Прирост = ТекущиеДанные.ТекущееПоказание - ТекущиеДанные.ПредыдущееПоказание;
	
КонецПроцедуры

