
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьФорматПлановойДатыНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПланированияПриИзменении(Элемент)
	
	ИзменитьФорматПлановойДатыНаСервере();
		
КонецПроцедуры

Процедура ИзменитьФорматПлановойДатыНаСервере()

	Если Объект.ПериодПланирования = 0 Тогда // однократно
		
		Элементы.ДатаПланирования.Видимость = Истина;
		Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd.MM.yyyy";
		Элементы.ДатаПланирования.Заголовок = "Дата";
		Элементы.ДатаНачала.Видимость = Ложь;
		Элементы.ДатаОкончания.Видимость = Ложь;
		Элементы.НомерДня.Видимость = Ложь;
		
	ИначеЕсли Объект.ПериодПланирования = 1 Тогда // еженедельно	
		
		Элементы.ДатаПланирования.Видимость = Ложь;
		//Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd.MM.yyyy";
		//Элементы.ДатаПланирования.Заголовок = "Дата расхода";
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.НомерДня.Видимость = Истина;
		Элементы.НомерДня.Заголовок = "День недели";
		
	ИначеЕсли Объект.ПериодПланирования = 2 Тогда // ежемесячно	
		
		Элементы.ДатаПланирования.Видимость = Ложь;
		Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd";
		Элементы.ДатаПланирования.Заголовок = "Число месяца";
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.НомерДня.Видимость = Истина;
		Элементы.НомерДня.Заголовок = "Число месяца";
		
	ИначеЕсли Объект.ПериодПланирования = 3 Тогда // ежегодно
		
		Элементы.ДатаПланирования.Видимость = Истина;
		Элементы.ДатаПланирования.ФорматРедактирования = "ДФ=dd.MM";
		Элементы.ДатаПланирования.Заголовок = "День года";
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.НомерДня.Видимость = Ложь;
	
	КонецЕсли; 

КонецПроцедуры


 
