&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтчета = ТекущаяДата();
	ВидыСчетов = Перечисления.ВидыСчетов.Балансовые;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = СформироватьОтчетСКД();
		
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСКД() Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
		
	ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДанных(ПараметрыДанных, "ДатаОтчета", ?(ЗначениеЗаполнено(ДатаОтчета), КонецДня(ДатаОтчета), ТекущаяДата()));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДанных(ПараметрыДанных, "СчетЯвляетсяЗабалансовым", ВидыСчетов = Перечисления.ВидыСчетов.Забалансовые);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДанных(ПараметрыДанных, "ПоказыватьВсеСчета", ВидыСчетов = Перечисления.ВидыСчетов.Все);
	
	ОтчетБД = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновки = ОтчетБД.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Отчет.КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(табДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТабДок;
	
КонецФункции