
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = СформироватьОтчетСКД(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСКД(ДатаНачала, ДатаОкончания) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	ТаблицаДанных = ПолучитьДанныеОтчета(ДатаНачала, ДатаОкончания);
	
	Если ТаблицаДанных <> Неопределено Тогда
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
		
		СхемаКомпоновки = Отчеты.ИсторияТочекАктуальности.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
				
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, СхемаКомпоновки.НастройкиПоУмолчанию);
		                                                                               
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
		
		ПроцессорВывода  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
		ПроцессорВывода.УстановитьДокумент(ТабДок);
		//ПроцессорВывода.УстановитьДокумент(Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьДанныеОтчета(ДатаНачала, ДатаОкончания)
	
	// получим запросом выборку точек актуальности
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ТочкиАктуальности.Период КАК Дата,
	                |	СУММА(ТочкиАктуальности.СуммаУчетн) КАК Сумма
	                |ИЗ
	                |	РегистрСведений.ТочкиАктуальности КАК ТочкиАктуальности
	                |ГДЕ
	                |	ТочкиАктуальности.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ТочкиАктуальности.Период
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Дата" ;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);				
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	//выгрузим и обработаем таблицу данных
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТаблицаДанных = РезультатЗапроса.Выгрузить();
		ТаблицаДанных.Колонки.Добавить("ДельтаПред");
		ТаблицаДанных.Колонки.Добавить("ДельтаНач");
		ТаблицаДанных.Колонки.Добавить("ШагТренда");
		
		ШагТренда = ТаблицаДанных[ТаблицаДанных.Количество() - 1].Сумма / ТаблицаДанных.Количество();
		
		СуммаНач = ТаблицаДанных[0].Сумма;
		СуммаПред = ТаблицаДанных[0].Сумма;
		НакопительныйТренд = 0;
		
		Для Каждого Строка Из ТаблицаДанных Цикл 
			Строка.ДельтаПред = Строка.Сумма - СуммаПред;
			Строка.ДельтаНач = Строка.Сумма - СуммаНач;
			НакопительныйТренд = НакопительныйТренд + ШагТренда;
			Строка.ШагТренда = НакопительныйТренд;
			СуммаПред = Строка.Сумма;
		КонецЦикла;	
	Иначе
		ТаблицаДанных = Неопределено;
	КонецЕсли;	
	
	Возврат ТаблицаДанных;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДатаНачала = ДобавитьМесяц(ТекущаяДата(), -4);
	Отчет.ДатаОкончания = ТекущаяДата();
	
КонецПроцедуры

