
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиПланируемыхПокупок.Записывать = Истина;
	
	// если отказываемся от планируемой покупки - сторнируем приходы и расходы по этой покупке
	Если ПричинаИзменения = ПредопределенноеЗначение("Перечисление.СостоянияПланируемойПокупки.Отказ") Тогда
		
		// проведение по регистру "Планируемые покупки"
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОстаткиПланируемыхПокупокОбороты.СуммаРасход,
		               |	ОстаткиПланируемыхПокупокОбороты.СуммаПриход
		               |ИЗ
		               |	РегистрНакопления.ОстаткиПланируемыхПокупок.Обороты(, &ДатаДокумента, , ПланируемаяПокупка = &ПланируемаяПокупка) КАК ОстаткиПланируемыхПокупокОбороты";
		Запрос.УстановитьПараметр("ДатаДокумента", Дата);
		Запрос.УстановитьПараметр("ПланируемаяПокупка", ПокупкаИсточник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			СторноПриход = Движения.ОстаткиПланируемыхПокупок.ДобавитьПриход();
			СторноПриход.ПланируемаяПокупка = ПокупкаИсточник;
			СторноПриход.Период = Дата;
			СторноПриход.Сумма = -Выборка.СуммаПриход;
			
			СторноРасход = Движения.ОстаткиПланируемыхПокупок.ДобавитьРасход();
			СторноРасход.ПланируемаяПокупка = ПокупкаИсточник;
			СторноРасход.Период = Дата;
			СторноРасход.Сумма = -Выборка.СуммаРасход;
			
		КонецЕсли;
		
		// проведение по регистру "Состояния планируемых покупок"
		Движения.СостоянияПланируемыхПокупок.Записывать = Истина;
		
		ЗаписьРС = РегистрыСведений.СостоянияПланируемыхПокупок.СоздатьМенеджерЗаписи();
		ЗаписьРС.ПланируемаяПокупка = ПокупкаИсточник;
		ЗаписьРС.Период = Дата;
		ЗаписьРС.Состояние = ПричинаИзменения;

		
	// если перемещаем деньги под другую покупку, тогда сторнируем данные расхода на одну покупку
	// и записываем их на другую покупку 
	ИначеЕсли ПричинаИзменения = ПредопределенноеЗначение("Перечисление.СостоянияПланируемойПокупки.ПеремещениеПодДругуюПокупку") Тогда
		
		// проведение по регистру "Планируемые покупки"
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОстаткиПланируемыхПокупокОбороты.СуммаРасход
		               |ИЗ
		               |	РегистрНакопления.ОстаткиПланируемыхПокупок.Обороты(, &ДатаДокумента, , ПланируемаяПокупка = &ПланируемаяПокупка) КАК ОстаткиПланируемыхПокупокОбороты";
		Запрос.УстановитьПараметр("ДатаДокумента", Дата);
		Запрос.УстановитьПараметр("ПланируемаяПокупка", ПокупкаИсточник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			СторноПП = Движения.ОстаткиПланируемыхПокупок.ДобавитьПриход();
			СторноПП.ПланируемаяПокупка = ПокупкаИсточник;
			СторноПП.Период = Дата;
			СторноПП.Сумма = -Выборка.СуммаРасход;
			
			ПриходПП = Движения.ОстаткиПланируемыхПокупок.ДобавитьПриход();
			ПриходПП.ПланируемаяПокупка = ПокупкаПриемник;
			ПриходПП.Период = Дата;
			ПриходПП.Сумма = Выборка.СуммаРасход;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоДня(Дата);
КонецПроцедуры
	                                      