#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Дата = НачалоДня(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// проведение по регистру "Планируемые покупки"
	Движения.ОстаткиПланируемыхПокупок.Записывать = Истина;
	ДвижениеПП = Движения.ОстаткиПланируемыхПокупок.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(ДвижениеПП, Ссылка);
	ДвижениеПП.Период = Дата;
	ДвижениеПП.Активность = Истина;
	
	// проведение по регистру "Состояния планируемых покупок"
	Движения.СостоянияПланируемыхПокупок.Записывать = Истина;
	ДвижениеСостояние = Движения.СостоянияПланируемыхПокупок.Добавить();
	ЗаполнитьЗначенияСвойств(ДвижениеСостояние, Ссылка, "Сумма,ПланируемаяПокупка");
	ДвижениеСостояние.Период = Дата;
	ДвижениеСостояние.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияПланируемойПокупки.Регистрация");
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
